app/views/endpoints/show.html.haml

-#    %form{:onsubmit => "return false;"}
-#      - @endpoint.sparql_queries.each do |query|
---
SELECT "sparql_queries".* FROM "sparql_queries" WHERE "sparql_queries"."endpoint_id" = 1