app/controllers/endpoints_controller.rb

  def index
    @endpoints = Endpoint.all
---
SELECT "endpoints".* FROM "endpoints"

  def show
    @endpoint = Endpoint.find(params[:id])
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @endpoint = Endpoint.find(params[:id])
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @endpoint = Endpoint.new(params[:endpoint])

    respond_to do |format|
      if @endpoint.save
---
INSERT INTO "endpoints" ("created_at", "name", "sparql_url", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @endpoint = Endpoint.find(params[:id])

    respond_to do |format|
      if @endpoint.update_attributes(params[:endpoint])
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "endpoints" SET "name" = 'talis2', "updated_at" = '2016-02-03 19:27:35.442031' WHERE "endpoints"."id" = 2

  def destroy
    @endpoint = Endpoint.find(params[:id])
    @endpoint.destroy
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "endpoints" WHERE "endpoints"."id" = ?  [["id", 1]]