app/controllers/sparql_queries_controller.rb

  def index
    @sparql_queries = SparqlQuery.all
---
SELECT "sparql_queries".* FROM "sparql_queries"

  def show
    @sparql_query = SparqlQuery.find(params[:id])
---
SELECT "sparql_queries".* FROM "sparql_queries" WHERE "sparql_queries"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @sparql_query = SparqlQuery.find(params[:id])
---
SELECT "sparql_queries".* FROM "sparql_queries" WHERE "sparql_queries"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @sparql_query = SparqlQuery.new(params[:sparql_query])

    respond_to do |format|
      if @sparql_query.save
---
INSERT INTO "sparql_queries" ("body", "created_at", "endpoint_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", nil], ["created_at", Thu, 04 Feb 2016 19:43:52 UTC +00:00], ["endpoint_id", nil], ["name", nil], ["updated_at", Thu, 04 Feb 2016 19:43:52 UTC +00:00]]

  def update
    @sparql_query = SparqlQuery.find(params[:id])

    respond_to do |format|
      if @sparql_query.update_attributes(params[:sparql_query])
---
SELECT "sparql_queries".* FROM "sparql_queries" WHERE "sparql_queries"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "sparql_queries" SET "query" = 'PREFIX geo0: <http://www.opengis.net/def/geosparql/> PREFIX geo: <http://www.opengis.net/ont/geosparql#> PREFIX geof: <http://www.opengis.net/ont/geosparql#/function/> PREFIX geo-sf: <http://www.opengis.net/ont/geosparql#/sf/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX gnis: <http://cegis.usgs.gov/rdf/gnis/> PREFIX nhd: <http://cegis.usgs.gov/rdf/nhd/> PREFIX gu: <http://cegis.usgs.gov/rdf/gu/> SELECT ?wkt WHERE { ?feature rdf:type gu:countyOrEquivalent . ?feature rdfs:label ?label . ?feature geo:hasGeometry ?g . ?g geo:asWKT ?wkt . }', "updated_at" = '2016-02-12 23:46:54.819686' WHERE "sparql_queries"."id" = 9

  def destroy
    @sparql_query = SparqlQuery.find(params[:id])
    @sparql_query.destroy
---
SELECT "sparql_queries".* FROM "sparql_queries" WHERE "sparql_queries"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "sparql_queries" WHERE "sparql_queries"."id" = ?  [["id", 2]]